#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/6b735674-9b81-4e18-8248-0482f47a5028/resourceGroups/taco-production-workshop]
azurerm_public_ip.catapp-pip: Refreshing state... [id=/subscriptions/6b735674-9b81-4e18-8248-0482f47a5028/resourceGroups/taco-production-workshop/providers/Microsoft.Network/publicIPAddresses/taco-production-ip]
azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/6b735674-9b81-4e18-8248-0482f47a5028/resourceGroups/taco-production-workshop/providers/Microsoft.Network/virtualNetworks/taco-production-vnet]
azurerm_network_security_group.catapp-sg: Refreshing state... [id=/subscriptions/6b735674-9b81-4e18-8248-0482f47a5028/resourceGroups/taco-production-workshop/providers/Microsoft.Network/networkSecurityGroups/taco-production-sg]
azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/6b735674-9b81-4e18-8248-0482f47a5028/resourceGroups/taco-production-workshop/providers/Microsoft.Network/virtualNetworks/taco-production-vnet/subnets/taco-production-subnet]
azurerm_network_interface.catapp-nic: Refreshing state... [id=/subscriptions/6b735674-9b81-4e18-8248-0482f47a5028/resourceGroups/taco-production-workshop/providers/Microsoft.Network/networkInterfaces/taco-production-catapp-nic]
azurerm_network_interface_security_group_association.catapp-nic-sg-ass: Refreshing state... [id=/subscriptions/6b735674-9b81-4e18-8248-0482f47a5028/resourceGroups/taco-production-workshop/providers/Microsoft.Network/networkInterfaces/taco-production-catapp-nic|/subscriptions/6b735674-9b81-4e18-8248-0482f47a5028/resourceGroups/taco-production-workshop/providers/Microsoft.Network/networkSecurityGroups/taco-production-sg]
azurerm_linux_virtual_machine.catapp: Refreshing state... [id=/subscriptions/6b735674-9b81-4e18-8248-0482f47a5028/resourceGroups/taco-production-workshop/providers/Microsoft.Compute/virtualMachines/taco-production-meow]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.catapp must be replaced
-/+ resource "azurerm_linux_virtual_machine" "catapp" {
      ~ computer_name                                          = "taco-production-meow" -> (known after apply)
      ~ custom_data                                            = (sensitive value) # forces replacement
      + disk_controller_type                                   = (known after apply)
      - encryption_at_host_enabled                             = false -> null
      ~ id                                                     = "/subscriptions/6b735674-9b81-4e18-8248-0482f47a5028/resourceGroups/taco-production-workshop/providers/Microsoft.Compute/virtualMachines/taco-production-meow" -> (known after apply)
        name                                                   = "taco-production-meow"
      ~ private_ip_address                                     = "10.42.0.4" -> (known after apply)
      ~ private_ip_addresses                                   = [
          - "10.42.0.4",
        ] -> (known after apply)
      ~ public_ip_address                                      = "52.146.41.80" -> (known after apply)
      ~ public_ip_addresses                                    = [
          - "52.146.41.80",
        ] -> (known after apply)
      - secure_boot_enabled                                    = false -> null
      - tags                                                   = {} -> null
      ~ virtual_machine_id                                     = "371543a1-8c70-485f-aca7-430c7376440f" -> (known after apply)
      - vtpm_enabled                                           = false -> null
        # (30 unchanged attributes hidden)

      ~ os_disk {
          ~ name                             = "taco-production-meow_OsDisk_1_c2b55e1f41954ee7935d892ae5a30ca7" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>

*Pusher: @bbraunstein-dodphilly2024, Action: `pull_request`, Working Directory: ``, Workflow: `Plan Production on PR to Main`*